goal/sessions/23cb78c0-b3a1-4ea3-89e2-332443ff1f8f/runs/20260818T055754Z-8dd3de85/artifacts/logs/bench-lat_final_v2_burst128.log
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x72c82cf672e0>, trust_remote_code=False, seed=0, num_prompts=128, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=512, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai', base_url=None, host='localhost', port=8013, endpoint='/v1/completions', header=None, max_concurrency=None, model='Qwen3.8-27B', input_len=None, output_len=None, tokenizer='Qwen/Qwen3.8-27B-FP8', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, probe_request_rate=0.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='/shared/vllm/goal/sessions/23cb78c0-b3a1-4ea3-89e2-332443ff1f8f/runs/20260818T055754Z-8dd3de85/artifacts/logs', result_filename='bench-lat_final_v2_burst128.json', ignore_eos=True, self_timed=None, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-943d15a7-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 08-18 09:51:00 [utils.py:90] Sampling input_len from [1024, 1024] and output_len from [512, 512]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 128/128 [02:21<00:00,  1.10s/it]
Failed requests during benchmark run detected (capping to 10):
Error 0: Never received a valid chunk to calculate TTFT.This response will be marked as failed!
Error 1: Never received a valid chunk to calculate TTFT.This response will be marked as failed!
Error 2: Never received a valid chunk to calculate TTFT.This response will be marked as failed!
Error 3: Never received a valid chunk to calculate TTFT.This response will be marked as failed!
Error 4: Never received a valid chunk to calculate TTFT.This response will be marked as failed!
Error 5: Never received a valid chunk to calculate TTFT.This response will be marked as failed!
Error 6: Never received a valid chunk to calculate TTFT.This response will be marked as failed!
Error 7: Never received a valid chunk to calculate TTFT.This response will be marked as failed!
Error 8: Never received a valid chunk to calculate TTFT.This response will be marked as failed!
Error 9: Never received a valid chunk to calculate TTFT.This response will be marked as failed!
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     32        
Failed requests:                         96        
Benchmark duration (s):                  141.02    
Total input tokens:                      32768     
Total generated tokens:                  16384     
Request throughput (req/s):              0.23      
Output token throughput (tok/s):         116.18    
Peak output token throughput (tok/s):    352.00    
Peak concurrent requests:                32.00     
Total token throughput (tok/s):          348.54    
---------------Time to First Token----------------
Mean TTFT (ms):                          7353.49   
Median TTFT (ms):                        8355.17   
P99 TTFT (ms):                           12388.07  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          63.03     
Median TPOT (ms):                        57.62     
P99 TPOT (ms):                           134.63    
---------------Inter-token Latency----------------
Mean ITL (ms):                           139.74    
Median ITL (ms):                         94.15     
P99 ITL (ms):                            1300.83   
---------------Speculative Decoding---------------
Acceptance rate (%):                     61.46     
Acceptance length:                       2.25      
Drafts:                                  29172     
Draft tokens:                            59185     
Accepted tokens:                         36374     
Per-position acceptance (%):
  Position 0:                            68.11     
  Position 1:                            56.14     
  Position 2:                            0.17      
  Position 3:                            0.12      
  Position 4:                            0.07      
  Position 5:                            0.05      
  Position 6:                            0.03      
==================================================